app/controllers/locations_controller.rb

  def show
    @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "113"]]

  def create
    @location = Location.new(params[:location])
    @slat=@@Lat
    @slong=@@Long

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("lat", "long") VALUES (?, ?)  [["lat", #<BigDecimal:7f469c2e0bf0,'0.0',9(18)>], ["long", #<BigDecimal:7f469c2e0c68,'0.0',9(18)>]]

  def destroy
    @location = Location.find(params[:id])
    @location.destroy
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "113"]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 113]]